Ran Plan for dir: `atlantis` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # kubernetes_deployment.atlantis will be updated in-place
~ resource "kubernetes_deployment" "atlantis" {
        id               = "atlantis/atlantis"
        wait_for_rollout = true

        metadata {
            annotations      = {
                "field.cattle.io/publicEndpoints" = jsonencode(
                    [
                        {
                            addresses   = [
                                "192.168.1.66",
                            ]
                            allNodes    = false
                            port        = 4141
                            protocol    = "TCP"
                            serviceName = "atlantis:atlantis"
                        },
                    ]
                )
            }
            generation       = 7
            labels           = {}
            name             = "atlantis"
            namespace        = "atlantis"
            resource_version = "65082604"
            uid              = "b19bf2eb-7e09-481b-9f08-6333d1a38087"
        }

      ~ spec {
            min_ready_seconds         = 0
            paused                    = false
            progress_deadline_seconds = 600
            replicas                  = "1"
            revision_history_limit    = 10

            selector {
                match_labels = {
                    "app" = "atlantis"
                }
            }

            strategy {
                type = "RollingUpdate"

                rolling_update {
                    max_surge       = "25%"
                    max_unavailable = "25%"
                }
            }

          ~ template {
                metadata {
                    annotations = {}
                    generation  = 0
                    labels      = {
                        "app" = "atlantis"
                    }
                }

              ~ spec {
                    active_deadline_seconds          = 0
                    automount_service_account_token  = true
                    dns_policy                       = "ClusterFirst"
                    enable_service_links             = true
                    host_ipc                         = false
                    host_network                     = false
                    host_pid                         = false
                    node_selector                    = {}
                    restart_policy                   = "Always"
                    service_account_name             = "atlantis"
                    share_process_namespace          = false
                    termination_grace_period_seconds = 30

                  ~ container {
                        args                       = [
                            "server",
                            "--gh-app-id",
                            "97394",
                            "--gh-app-key-file",
                            "/etc/gh/atlantis-app-key",
                            "--write-git-creds",
                        ]
                        command                    = []
                        image                      = "runatlantis/atlantis:v0.16.0"
                        image_pull_policy          = "IfNotPresent"
                        name                       = "atlantis"
                        stdin                      = false
                        stdin_once                 = false
                        termination_message_path   = "/dev/termination-log"
                        termination_message_policy = "File"
                        tty                        = false

                        env {
                            name  = "ATLANTIS_ATLANTIS_URL"
                            value = "https://atlantis.qtosw.com"
                        }
                        env {
                            name  = "ATLANTIS_DEFAULT_TF_VERSION"
                            value = "0.13.6"
                        }
                      ~ env {
                          ~ name  = "ATLANTIS_HIDE_PREV_PLAN_COMMENTS" -> "ATLANTIS_PORT"
                          ~ value = "true" -> "4141"
                        }
                      ~ env {
                          ~ name  = "ATLANTIS_PORT" -> "ATLANTIS_REPO_CONFIG_JSON"
                          ~ value = jsonencode(
                              ~ 4141 -> {
                                  + repos = [
                                      + {
                                          + allowed_overrides  = [
                                              + "workflow",
                                            ]
                                          + apply_requirements = [
                                              + "approved",
                                              + "mergeable",
                                            ]
                                          + id                 = "/.*/"
                                        },
                                    ]
                                }
                            )
                        }
                      ~ env {
                          ~ name  = "ATLANTIS_REPO_CONFIG_JSON" -> "ATLANTIS_REPO_WHITELIST"
                          ~ value = <<~EOT
                              - {"repos": [{"id": "/.*/","apply_requirements": ["approved","mergeable"],"allowed_overrides": ["workflow"]}]}
                              + github.com/tyzbit/*
                            EOT
                        }
                      ~ env {
                          ~ name  = "ATLANTIS_REPO_WHITELIST" -> "AWS_ACCESS_KEY_ID"
                          - value = "github.com/tyzbit/*" -> null

                          + value_from {

                              + secret_key_ref {
                                  + key  = "AWS_ACCESS_KEY_ID"
                                  + name = "terraform-aws-keys"
                                }
                            }
                        }
                      ~ env {
                          ~ name = "AWS_ACCESS_KEY_ID" -> "AWS_SECRET_ACCESS_KEY"

                          ~ value_from {

                              ~ secret_key_ref {
                                  ~ key      = "AWS_ACCESS_KEY_ID" -> "AWS_SECRET_ACCESS_KEY"
                                    name     = "terraform-aws-keys"
                                    optional = false
                                }
                            }
                        }
                      ~ env {
                          ~ name = "AWS_SECRET_ACCESS_KEY" -> "NEW_RELIC_ACCOUNT_ID"

                          ~ value_from {

                              ~ secret_key_ref {
                                  ~ key      = "AWS_SECRET_ACCESS_KEY" -> "NEW_RELIC_ACCOUNT_ID"
                                  ~ name     = "terraform-aws-keys" -> "terraform-newrelic-keys"
                                    optional = false
                                }
                            }
                        }
                      ~ env {
                          ~ name = "NEW_RELIC_ACCOUNT_ID" -> "NEW_RELIC_API_KEY"

                          ~ value_from {

                              ~ secret_key_ref {
                                  ~ key      = "NEW_RELIC_ACCOUNT_ID" -> "NEW_RELIC_API_KEY"
                                    name     = "terraform-newrelic-keys"
                                    optional = false
                                }
                            }
                        }
                      ~ env {
                          ~ name = "NEW_RELIC_API_KEY" -> "ATLANTIS_GH_WEBHOOK_SECRET"

                          ~ value_from {

                              ~ secret_key_ref {
                                  ~ key      = "NEW_RELIC_API_KEY" -> "webhook-secret"
                                  ~ name     = "terraform-newrelic-keys" -> "github-webhook"
                                    optional = false
                                }
                            }
                        }
                      - env {
                          - name = "ATLANTIS_GH_WEBHOOK_SECRET" -> null

                          - value_from {

                              - secret_key_ref {
                                  - key      = "webhook-secret" -> null
                                  - name     = "github-webhook" -> null
                                  - optional = false -> null
                                }
                            }
                        }

                        liveness_probe {
                            failure_threshold     = 3
                            initial_delay_seconds = 0
                            period_seconds        = 10
                            success_threshold     = 1
                            timeout_seconds       = 1

                            http_get {
                                path   = "/healthz"
                                port   = "4141"
                                scheme = "HTTP"
                            }
                        }

                        port {
                            container_port = 4141
                            host_port      = 0
                            name           = "atlantis"
                            protocol       = "TCP"
                        }

                        readiness_probe {
                            failure_threshold     = 3
                            initial_delay_seconds = 0
                            period_seconds        = 10
                            success_threshold     = 1
                            timeout_seconds       = 1

                            http_get {
                                path   = "/healthz"
                                port   = "4141"
                                scheme = "HTTP"
                            }
                        }

                        resources {}

                        volume_mount {
                            mount_path        = "/etc/gh"
                            mount_propagation = "None"
                            name              = "app-key"
                            read_only         = true
                        }
                    }

                    volume {
                        name = "app-key"

                        secret {
                            default_mode = "0644"
                            optional     = false
                            secret_name  = "github-app-key"
                        }
                    }
                }
            }
        }

        timeouts {
            create = "3m"
            update = "3m"
        }
    }

  # kubernetes_ingress.atlantis will be created
+ resource "kubernetes_ingress" "atlantis" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "atlantis"
            }
          + name             = "atlantis"
          + namespace        = "atlantis"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {

          + rule {
              + host = "atlantis.qtosw.com"

              + http {
                  + path {
                      + path = "/*"

                      + backend {
                          + service_name = "ssl-redirect"
                          + service_port = "use-annotation"
                        }
                    }
                  + path {
                      + path = "/*"

                      + backend {
                          + service_name = "atlantis"
                          + service_port = "4141"
                        }
                    }
                }
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d atlantis`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.qtosw.com/lock?id=tyzbit%252Fterraform%252Fatlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d atlantis`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
